Tekla Open API Reference for Tekla Structures 2025
StraightDimensionSet.StraightDimensionSetAttributes.ExtensionLine Property
 The extension line presentation of the dimension.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DimensionSetBaseAttributes.ExtensionLineTypes ExtensionLine { get; set; }
Public Property ExtensionLine As DimensionSetBaseAttributes.ExtensionLineTypes
	Get
	Set
Property Value
Type: DimensionSetBaseAttributes.ExtensionLineTypes
See Also
Reference
StraightDimensionSet.StraightDimensionSetAttributes Class
Tekla.Structures.Drawing Namespace